app/controllers/comments_controller.rb

  def create
    @prototype = Prototype.find(params[:prototype_id])
    @comment = @prototype.comments.new(comment_params)
    @comment.user = current_user

    respond_to do |format|
      if @comment.save
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`text`, `user_id`, `prototype_id`, `created_at`, `updated_at`) VALUES ('いいですね', 1, 1, '2025-08-11 09:01:30.492746', '2025-08-11 09:01:30.492746')