app/controllers/prototypes_controller.rb

SELECT `prototypes`.* FROM `prototypes`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (2, 1)
---
  def index
    @prototypes = Prototype.includes(:user).all

INSERT INTO `prototypes` (`title`, `catch_copy`, `concept`, `user_id`, `created_at`, `updated_at`) VALUES ('プロトタイプ１', 'プロトタイプ１のキャッチコピーです', 'プロトタイプ１のコンセプトです', 2, '2025-08-11 08:15:28.815275', '2025-08-11 08:15:28.815275')
---
  def create
    @prototype = Prototype.new(prototype_params)
    if @prototype.save

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1
---
  def show
   @prototype = Prototype.find(params[:id])

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 2 LIMIT 1
DELETE FROM `prototypes` WHERE `prototypes`.`id` = 2
---
 def destroy
  @prototype = Prototype.find(params[:id])
   if @prototype.destroy

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1
---
 def set_prototype
  @prototype = Prototype.find(params[:id])